# Public Transit Database Lab

In [65]:
import pandas as pd
from sqlalchemy import create_engine

### Connect to database

In [66]:
DATABASE_URL = 'postgresql://postgres.yjajdrzerpwleueoclby:07wbqdbaifUDjqCi@aws-0-us-west-1.pooler.supabase.com:6543/postgres'
engine = create_engine(DATABASE_URL)
engine

Engine(postgresql://postgres.yjajdrzerpwleueoclby:***@aws-0-us-west-1.pooler.supabase.com:6543/postgres)

### Read in the datasets into dataframes

In [67]:
nyc_df = pd.read_csv('MTA_Monthly_Ridership___Traffic_Data__Beginning_January_2008.csv')
chicago_df = pd.read_csv('CTA_-_Ridership_-_Daily_Boarding_Totals_20240819.csv')

In [68]:
nyc_df.head()

        Month Agency  Ridership
0  01/01/2008    MNR    6453734
1  02/01/2008    MNR    6144377
2  03/01/2008    MNR    6602280
3  04/01/2008    B&T   24900328
4  04/01/2008    MNR    6787480

In [70]:
chicago_df.head()

  service_date day_type     bus  rail_boardings  total_rides
0   01/01/2001        U  297192          126455       423647
1   01/02/2001        W  780827          501952      1282779
2   01/03/2001        W  824923          536432      1361355
3   01/04/2001        W  870021          550011      1420032
4   01/05/2001        W  890426          557917      1448343

### NYC Subway Data Transformation

In [69]:
nyc_df['Agency'].unique()

array(['MNR', 'B&T', 'Bus', 'Subway', 'LIRR', 'AAR', 'SIR'], dtype=object)

In [71]:
nyc_df['month'] = pd.to_datetime(nyc_df['Month'], format='%m/%d/%Y', errors='coerce')
nyc_df['city'] = 'New York'

# Create a mapping for agencies to transportation types
agency_to_transportation = {
    'MNR': 'metro',    # Metro-North Railroad
    'B&T': 'bus',      # Bridges and Tunnels
    'Bus': 'bus',      # Bus
    'Subway': 'metro', # Subway
    'LIRR': 'metro',   # Long Island Rail Road
    'AAR': 'bus',      # Access-A-Ride
    'SIR': 'metro'     # Staten Island Railway
}
nyc_df['transportation_type'] = nyc_df['Agency'].map(agency_to_transportation)
nyc_df.rename(columns={'Ridership': 'ridership_count'}, inplace=True)
nyc_df = nyc_df[['month', 'city', 'transportation_type', 'ridership_count']]

### Chicago CTA Data Transformation

In [72]:
chicago_df['month'] = pd.to_datetime(chicago_df['service_date'], format='%m/%d/%Y', errors='coerce')
chicago_df['city'] = 'Chicago'

bus_df = chicago_df.groupby('month').agg({'bus': 'sum'}).reset_index()
bus_df['transportation_type'] = 'bus'
bus_df.rename(columns={'bus': 'ridership_count'}, inplace=True)

rail_df = chicago_df.groupby('month').agg({'rail_boardings': 'sum'}).reset_index()
rail_df['transportation_type'] = 'metro'
rail_df.rename(columns={'rail_boardings': 'ridership_count'}, inplace=True)

chicago_df_combined = pd.concat([bus_df, rail_df])
chicago_df_combined['city'] = 'Chicago'

### Combine nyc and chicago dataframes

In [73]:
monthly_totals = pd.concat([nyc_df, chicago_df_combined[['month', 'city', 'transportation_type', 'ridership_count']]])

### Correct data types

In [75]:
monthly_totals['ridership_count'] = monthly_totals['ridership_count'].astype(int)

### Load data into postgresql

In [76]:
monthly_totals.to_sql('monthly_totals', engine, if_exists='replace', index=False)

761

### Check that it was loaded correctly

In [77]:
sql = 'SELECT * FROM monthly_totals'
results_df = pd.read_sql(sql, engine)
results_df

           month      city transportation_type  ridership_count
0     2008-01-01  New York               metro          6453734
1     2008-02-01  New York               metro          6144377
2     2008-03-01  New York               metro          6602280
3     2008-04-01  New York                 bus         24900328
4     2008-04-01  New York               metro          6787480
...          ...       ...                 ...              ...
17756 2024-04-26   Chicago               metro           355278
17757 2024-04-27   Chicago               metro           286199
17758 2024-04-28   Chicago               metro           196481
17759 2024-04-29   Chicago               metro           349857
17760 2024-04-30   Chicago               metro           409097

[17761 rows x 4 columns]

### Create bus_monthly_totals and metro_monthly_totals

In [86]:
# Filter data for bus and metro
bus_monthly_totals = monthly_totals[monthly_totals['transportation_type'] == 'bus']
metro_monthly_totals = monthly_totals[monthly_totals['transportation_type'] == 'metro']

# write bus and metro totals to database
bus_monthly_totals.to_sql('bus_monthly_totals', engine, if_exists='replace', index=False)
metro_monthly_totals.to_sql('metro_monthly_totals', engine, if_exists='replace', index=False)

913

### Check the contents of bus_monthly_totals

In [91]:
pd.read_sql('SELECT * FROM bus_monthly_totals', engine)

          month      city transportation_type  ridership_count
0    2008-04-01  New York                 bus         24900328
1    2008-05-01  New York                 bus         26172575
2    2008-06-01  New York                 bus         25940107
3    2008-07-01  New York                 bus         26189384
4    2008-08-01  New York                 bus         26448624
...         ...       ...                 ...              ...
8843 2024-04-26   Chicago                 bus           554146
8844 2024-04-27   Chicago                 bus           419731
8845 2024-04-28   Chicago                 bus           293589
8846 2024-04-29   Chicago                 bus           556233
8847 2024-04-30   Chicago                 bus           632501

[8848 rows x 4 columns]

### Check the contents of metro_monthly_totals

In [92]:
pd.read_sql('SELECT * FROM metro_monthly_totals', engine)

          month      city transportation_type  ridership_count
0    2008-01-01  New York               metro          6453734
1    2008-02-01  New York               metro          6144377
2    2008-03-01  New York               metro          6602280
3    2008-04-01  New York               metro          6787480
4    2008-05-01  New York               metro          6840901
...         ...       ...                 ...              ...
8908 2024-04-26   Chicago               metro           355278
8909 2024-04-27   Chicago               metro           286199
8910 2024-04-28   Chicago               metro           196481
8911 2024-04-29   Chicago               metro           349857
8912 2024-04-30   Chicago               metro           409097

[8913 rows x 4 columns]